{
  "blogs": [
    {
      "title": "Quantitative Research",
      "body": "As the name suggests, Quantitative data relies on quantifying a certain amount or quantity of a specific phenomenon. It focuses on gathering and analyzing numerical data and can be used to find averages and patterns or to predict outcomes.\nQuantitative Research falls within the two primary categories of research and relies on numbers. It draws a conclusion using tables, facts, and graphs. Many scientific and field-based studies primarily use this form of research.\n\nIt refers to the non-numerical elements in the research. Qualitative research comes to the rescue when the researcher cannot grasp the information or data regarding numbers. Though not as reliable as Quantitative research, qualitative research helps to form a better summary of theories in the data\nMoreover, this type of research is interested in discovering the motivating factors behind human behavior, i.e., why people act or think in a particular way. Through this research, one can understand the variables driving people to behave in a certain way or which govern their inclinations toward one specific thing.\n",
      "author": "sammy",
      "id": 2
    },
    {
      "title": "Applied Research",
      "body": "Action research that only studies one domain and usually generalizes the findings is called applied research. The researcher regards the variables as constant, and the researcher forecasts, making the methods easy to find in applied research.\nApplied research aims to solve a current issue facing society or a business/industrial organization. Applied research is considered non-systematic inquiry; a business, government body, or individual typically conducts this research to address a particular issue.\nAn instance would be a study of marketing tactics to appeal to Millenials’ goals in China.\n",
      "author": "bammy",
      "id": 3
    },
    {
      "title": "A PROPOSAL ON ONLINE REAL ESTATEMANAGEMENT SYSTEM (CASE STUDY OF ADRON HOMES)",
      "body": "BACKGROUND OF STUDY\nThe real estate industry encompasses many faces of property including development, marketing, selling, leasing and management of commercial, industrial, residential and agricultural properties. This industry can fluctuate depending on the national or local economies although it remains consistent due to the fact that people always need homes and businesses always need workplace The real estate is evolving from an agricultural society to an industrial one. this is occurring due to the transformation of the industrial revolution for one urban center swells as people move from rural places to cities, and as the cities develop the need for real estate transaction are increasing hence a high potential for real estate. Online real estate will increase chances for one to find a suitable place for both work and residential. This is by improving the marketing and transaction of real estate in the near future due to the advancement of technology and spread internet connection around the country.\n\nINTRODUCTION\nOnline real estate management system (OREMS) is a comprehensive web-based application designed to streamline and automate the processes involved in real estate management. The system provides a platform for property owners, agents, buyers or tenants to interact, manage and facilitate efficient property transaction. This system will require registration of users or clients, users will be able to verify and get information on how to get to the owner of the building, users will be able to select their choice of services that should be rendered either by booking, buying or cancelling of services. it will also provide a consultation platform for enquires and a transaction platform to make purchase of real estate’s products.\n\nSTATEMENT OF PROBLEMS\nFinding properly built and authentic real estate properties which are already well and fully furnished is quite tiresome and difficult most real estate business only build one house or apartment for advertisement then use that one building to convince people to buy house or building that are not even built hence the need of change , this software is to act as a easy way for investors to identify building or apartments that they need hence to avoid instances where one buys a building or apartment which is not built.\n\nPROJECT AIM\nThe aim of this project is to develop a web-based online real estate management system to help ease real estate professionals and workers of stress thus making business to be faster and cheaper. Since the system removes geographical limitation factor, all clients can bid for their preferred properties regardless of the location.\n\nPROJECT OBJECTIVES\n•\tThe aim of this project is carried out through the following objectives:\n•\tTo develop a web-based app that performs real estate operations.\n•\tTo develop a web-based app that provide user friendly interface\n•\tTo investigate user requirements for a real estate management system \n•\tTo provide an online platform where users can buy properties online and rent apartments online.\n•\tTo provide management and administrators of companies an easy way to manage and monitor the entire business transaction process from a computer-based interface. \n•\tTo come up with system documentation\n•\tTo prove supremacy over the existing manual system of estate management.\n\n\nPROJECT SCOPE OF STUDY\nThe scope of this study is limited to the design and implementation of an online real estate managements which will focus on Adron homes but the software can be used by companies with similar business anywhere in the world.\n\n\nJUSTIFICATION OF PROJECT\nThe need for real estate business is gradually increasing as the rural urban migration increases day by day the rise of need for residential places for people to stay, I increase and work space for business increases. Hence the real estate will continue being part of the community. Finding a suitable place with all the necessary amenities is quite tiresome and paper work for these kinds of transaction and validation of the authenticity of the product is difficult hence online real estate is bound to make a smooth, fast and safe transaction for you right where you are. providing a wide variety of real estate product to choose from.\n\n\nDEFINITION OF TERMS\nProperty listing: a property listing refers to an advertisement or online representation of a property available for sale, rent, or lease. \nLandlord: the landlord is the owner of property who rents or lease it to a tenant\nTenants: a tenant is an individual or business entity that rents or lease a property from the landlord \nProperty manager: a property manager is a person or a company responsible for managing and overseeing the day-to-day operations of a property ion behalf of the owner. They handle task like tenant screening, rent collection, maintenance and more.\nOnline property management system: is a web-based Platform or software that enables property owners and managers to streamline their operations including property listing tenant management financial tracking and communication.\nDash- board: a dashboard is the main interface of the online real estate management system that provides and overview of important information and quick access to various features and functionalities.\nLease agreement: a lease agreement is a legal binding contract between the landlord and the tenants that’s outlines the terms and condition of the rental or lease agreement including the rent amount, duration, responsibilities and period of occupancy.\nOccupancy rate: occupancy rate is a measure of the4 percentage of rented or lease unit within a property. It indicates how well the property is been utilized and its often used as performance metrics.\nProperty analytics: property analytics involves using data and analytics to gain insight into property performance, market trends, tenants’ behavior and financial metrics. Online management systems may provide analytics tools and report for property owners and manager.\nDocument management: it refers to the organization, storage, storage and retrieval of important document related to property management such as lease agreement, client’s applications, maintenance records and financial documents. An online system can facilitate secured documents storage and easy access.\n",
      "author": "sammy",
      "id": 4
    },
    {
      "title": "   DescriptiveResearch",
      "body": "Descriptive research is a type of analysis that outlines the features of the population or issues under study. This type of methodology focuses more on the “what” of the research problem than the “why.” Since the researcher cannot influence the variables in this research design, they can only report the facts precisely as they occurred or are occurring.\nThe primary methods used in descriptive research include observations, surveys, and case studies. One can use many variables in descriptive research to explain the facts.\nIts advantages include a) being effective at analyzing topics and issues that cannot rely on numbers, b) being observable in an unaltered natural environment, and c) taking less time than quantitative experiments.\n",
      "author": "Tayo",
      "id": 5
    }
  ]
}